Revit 2027 API
BuiltInFailures.StairRampFailures.NotALineRiserRampError Property
 Riser line must be a straight line for Ramps.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotALineRiserRampError { get; }
Public Shared ReadOnly Property NotALineRiserRampError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotALineRiserRampError {
	FailureDefinitionId^ get ();
}
static member NotALineRiserRampError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace